---
kind: property
id: P:Autodesk.Revit.DB.KeyBasedTreeEntry.Key
source: html/a9234c64-9ec4-7c5e-e94e-70e69452ca1c.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntry.Key Property

The key of this entry.

## Syntax (C#)
```csharp
public string Key { get; }
```

## Remarks
This value will be used to do retrieval, sort and comparison.
 This value should not be empty.